In [72]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [73]:
# Dictionary를 이용한 DataFrame생성
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [74]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

---
# 행 이름 바꾸기

In [75]:
# list를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서',"예은"],
    columns=["나이",'성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [76]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [77]:
# 행 인덱스, 열 이름 변경하기 -1
df.index = ['학생1', '학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

---
- df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기

In [78]:
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서',"예은"],
    columns=["나이",'성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [79]:
df.rename(columns={'나이' : '연령','성별':'남녀','학교':'소속'}, inplace=True)
df
#inplace=True : 바로 적용

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [80]:
df = pd.DataFrame(
    [[90,98,85,100],
    [80,89,95,90],
    [70,95,100,90]],
    index= ['서준','우현','인아'],
    columns=['수학','영어','음악','체육']
)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [81]:
dict = {'수학':[90,80,70],'영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}
dict

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [82]:
dict1=pd.DataFrame(dict)
dict1

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

---
### 행삭제

In [83]:
df2 = df.copy()

In [84]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [85]:
# df2의 index가 우연히 1개행을 삭제
df2.drop('우현', inplace=True)

In [86]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [87]:
df4 = df.copy()

In [88]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [89]:
df4.drop('우현', axis=0, inplace=True)

In [90]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [91]:
df3 = df.copy()

In [92]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [93]:
# df3의 index가 우현과 인아의 2개 행을 삭제
df3.drop(['우현','인아'],axis=0, inplace=True) #axis="rows" 가능

In [94]:
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [95]:
df5 = df.copy()

In [96]:
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [97]:
# df5의 수학 1개 열을 삭제
df5.drop('수학', axis=1,inplace=True) #axis="columns" 가능

In [98]:
df5

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [99]:
df6 = df.copy()
df6

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [100]:
# df6 영어,음악 열 삭제
df6.drop(['영어','음악'], axis= "columns", inplace =True)
df6

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---

### 행선택
- index 이름을 기준으로 선택할 경우에는 loc
- 정수형 위치 index를 사용할 경우에는 iloc

In [101]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [102]:
# index가 기준인 행을 선택
print(df.loc['서준'])
print(df.iloc[0])

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [103]:
# 행 인덱스를 사용하여 서준과 우현 2개의 행을 선택
# loc사용
print(df.loc[['서준','우현']])
# iloc사용
print(df.iloc[[0,1]])
print(df.iloc[0:2]) # 대괄호를 하나만 쓰려면

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

## 열 선택

In [104]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [105]:
df['수학'] # index와 같이 나온다.

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [106]:
df.수학 # 위와 같다.

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

### 범위 Slicing 활용
- dataFrame.iloc[시작index:끝index:증가치]

In [107]:
df.iloc[::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [108]:
df.iloc[0:3:2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [109]:
df.iloc[::-1] # -1은 꺼꾸로 이다. 뒤부터 시작

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

## 행과 열을 이용한 데이터 선택

In [180]:
exam_data= {'수학':[90,80,70],'영어':[98,89,95],
            '음악':[85,95,100],'체육':[100,90,90],
            '이름':['서준','우현','연아']}
df= pd.DataFrame(exam_data)

In [181]:
# index이름을 정하기
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
연아  70  95  100   90

In [182]:
print(df.loc['서준',['음악','체육']])
print(df.iloc[0,[2,3]])
print(df.iloc[0,2:4])
print(df.iloc[0,2:])
print(df.loc['서준','음악':'체육'])
print(df.loc['서준','음악':])

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

### 컬럼(행)추가

In [183]:
df['국어']= [10,20,30]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  10
우현  80  89   95   90  20
연아  70  95  100   90  30

In [184]:
df.loc['철수'] = [10,20,30,40,50]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  10
우현  80  89   95   90  20
연아  70  95  100   90  30
철수  10  20   30   40  50

In [185]:
df.loc['영희'] = df.loc['연아']
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  10
우현  80  89   95   90  20
연아  70  95  100   90  30
철수  10  20   30   40  50
영희  70  95  100   90  30

In [186]:
# 서준의 체육점수를 80점으로 변경하기
df.loc['서준','체육'] = 80 
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [187]:
df.iloc[0,3] = 80
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [188]:
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [189]:
# 서준의 음악과 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [190]:
df.iloc[0,2:4] = 60
df

    수학  영어   음악  체육  국어
이름
서준  90  98   60  60  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [191]:
# 서준의 음악 점수를 100점 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = 100,50
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [192]:
df.iloc[0,2:4] = 30,40
df

    수학  영어   음악  체육  국어
이름
서준  90  98   30  40  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

### 행과 열의 위치 바꾸기

In [193]:
df

    수학  영어   음악  체육  국어
이름
서준  90  98   30  40  10
우현  80  89   95  90  20
연아  70  95  100  90  30
철수  10  20   30  40  50
영희  70  95  100  90  30

In [194]:
df.transpose()

이름  서준  우현   연아  철수   영희
수학  90  80   70  10   70
영어  98  89   95  20   95
음악  30  95  100  30  100
체육  40  90   90  40   90
국어  10  20   30  50   30

In [195]:
df.T

이름  서준  우현   연아  철수   영희
수학  90  80   70  10   70
영어  98  89   95  20   95
음악  30  95  100  30  100
체육  40  90   90  40   90
국어  10  20   30  50   30

In [196]:
wow= {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15],}
wow

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [198]:
df= pd.DataFrame(wow, index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [199]:
# 인덱스를 재설정하기
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index, fill_value=0) #NaN값을 0으로 바꿀때
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [200]:
ndf = df.reset_index() # 새 Columns로 들어간다.
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [201]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [202]:
# 내림차순으로 행 인덱스 정렬
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [203]:
df.sort_index(ascending=False) # 인덱스로 내림차순

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [204]:
# 특정 값을 기준으로 정렬
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [205]:
df.sort_values(by='c1', ascending=False,inplace=True)# 바로적용, 어디든 다쓸 수 있다.

In [206]:
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

---
### DataFrame 연산

In [165]:
import seaborn as sns # 타이타닉 데이터 가져오기 위해

In [166]:
titanic = sns.load_dataset('titanic')
titanic.head()
#컬럼가지고 새로운 컬럼을 유추하는것을 특성공학 
# ex) who- 부터

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [172]:
# titanic에서 age와 fare부분의 컬럼만 발췌하여 df라는 dataframe 만들기
df = titanic.loc[:,['age','fare']]
type(df)
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [173]:
df.describe() # 숫자인지 볼 수 있다.

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [176]:
# 모든 커럼을 10번씩 증가하여 addition이라는 dataframe 생성하기
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [179]:
# addition과 df의 차를 구하여 subtraction이라는 DataFrame 만들기
subtraction = addition - df
subtraction.head()

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0